In [2]:
import mysql.connector as priyanka

In [3]:
conn=priyanka.connect(host='localhost',user='root')

In [4]:
mycur=conn.cursor()

In [4]:
sql1='create database Hotel'

In [4]:
sql2='use Hotel'

In [5]:
mycur.execute(sql2)

In [8]:
sql3='create table checkin(days varchar(50),names varchar(20),aadhar varchar(50),date varchar(20),typenumber varchar(50))'

In [7]:
mycur.execute(sql3)

In [10]:
sql4='create table checkout(typenumber varchar(20),guests int(20),fare int(60),days int(30),tbill int(30),date varchar(50))'

In [11]:
mycur.execute(sql4)

In [8]:
conn.commit()

In [5]:
conn=priyanka.connect(host='localhost',user='root',database='hotel')

In [ ]:
def checkin():
    d=input('days:')
    g=input('names:')
    a=input("Adhar:")
    
    dt=input("date: ")
    b=input('type&number:')
    data=(d,g,a,dt,b)
    sql='insert into checkin values(%s,%s,%s,%s,%s)'
    mycur=conn.cursor()
    mycur.execute(sql,data)
    conn.commit()
    print("data entered sucessfully")
    main()

def checkout():
    b=input('type&number:')
    tg=int(input("guests:"))
    f=int(input('Fare:'))
    d=int(input('days:'))
    bl=f*d*tg
    cod=input('date:')
    data=(b,tg,f,d,bl,cod)
    sql='insert into checkout values(%s,%s,%s,%s,%s,%s)'
    mycur=conn.cursor()
    mycur.execute(sql,data)
    conn.commit()
    print("data entered successfully")
    main()
    
def rooms():
    print("Executive-5000/d/g")
    print(" ")
    print("""Facilities-wifi,TV,AC,Bathroom With Tub and geyser,Breakfast,lunch,dinner""")
    print(" ")
    print("Deluxe-2500/d/g")
    print(" ")
    print("""Facilities-wifi,TV,AC,Bathroom with Tub and Geyser""")
    print(" ")
    print("Simple-1000/d/g")
    print(" ")
    print("""Facilities-wifi,TV,Bathroom With Geyser""")
    main()
    
def main():
    print("1.Checkin")
    print("2.Checkout")
    print("3.Fare and Amenities")
    print("4.exit")
    c=int(input("Choice:  "))
    if c==1:
        checkin()
    elif c==2:
        checkout()
    elif c==3:
        rooms()
    elif c==0:
        print(quit)
        quit()
        conn.commit()
        
    else:
        print("enter a correct choice")
        #exit()
    main()
main()

1.Checkin
2.Checkout
3.Fare and Amenities
4.exit

In [7]:
import pandas as pd

In [8]:
pd.read_sql_query("select*from checkin",conn)

  days        names        aadhar       date typenumber
0    2  priyanka,om  906690669066  10/2/2020        e10
1    6         manu  121212121212   6/8/2020        e20
2    2  priyanka,om  960096009600  10/2/2020        e10
3    3         manu  300030003000  11/2/2020        e20
4    5         samu  450045004500  15/2/2020        e30
5    2     priyanka  960096009600  10/2/2020        e10
6    3         manu  120012001200  11/2/2020        e20
7    4         samu  505050505050  12/2/2020        e30
8    2  priyanka,om  202020202020  10/2/2020        e10
9    2  priyanka,om    1212121212  10/2/2020        e10

In [10]:
x=pd.read_sql_query("select*from checkout",conn)

In [11]:
x

  typenumber  guests  fare  days  tbill       date
0        e10       2  5000     2  20000  12/2/2020
1        e10       2  5000     2  20000  12/2/2020
2        e20       1  2500     6  15000  12/8/2020
3        e10       2  5000     3  30000  14/2/2020
4        e10       2  5000     2  20000  12/2/2020
5        e20       1  2500     3   7500  14/2/2020
6        e30       1  1000     4   4000  16/2/2020
7        e10       2  5000     2  20000  12/2/2020
8        e10       2  5000     2  20000  12/2/2020

In [12]:
x.head()

  typenumber  guests  fare  days  tbill       date
0        e10       2  5000     2  20000  12/2/2020
1        e10       2  5000     2  20000  12/2/2020
2        e20       1  2500     6  15000  12/8/2020
3        e10       2  5000     3  30000  14/2/2020
4        e10       2  5000     2  20000  12/2/2020

In [13]:
x.describe

<bound method NDFrame.describe of   typenumber  guests  fare  days  tbill       date
0        e10       2  5000     2  20000  12/2/2020
1        e10       2  5000     2  20000  12/2/2020
2        e20       1  2500     6  15000  12/8/2020
3        e10       2  5000     3  30000  14/2/2020
4        e10       2  5000     2  20000  12/2/2020
5        e20       1  2500     3   7500  14/2/2020
6        e30       1  1000     4   4000  16/2/2020
7        e10       2  5000     2  20000  12/2/2020
8        e10       2  5000     2  20000  12/2/2020>

In [18]:
mycur=conn.cursor()

In [19]:
mycur.execute("select*from checkout where tbill>20000")
myresult=mycur.fetchall()
for row in myresult:
    print(row)

('e10', 2, 5000, 3, 30000, '14/2/2020')

In [23]:
mycur.execute("select*from checkin where names='priyanka'")
res=mycur.fetchall()
for row in res:
    print(row)

('2', 'priyanka', '960096009600', '10/2/2020', 'e10')